import { Text } from "../../styled";
import * as S from "./styled";

export const SecondStep = () => {
  return (
    <S.Wrapper>
      <S.BlockTitle>Россия это</S.BlockTitle>
      <Text>
        Россия – это магия просторов, где бескрайние равнины ласкают взор своей
        бескрайней гармонией. С отлогими полями, золотящимися под лучами заката,
        она встречает свой народ широким объятием небесного свода. Здесь в
        каждой травинке укладывается история, древность, и величие, как камни на
        дороге времени.
        <br />
        <br />
        По мере того, как солнце садится за линию горизонта, Россия
        преображается в картину из тысяч огней – мерцающих на глади вод, отражая
        бескрайнюю ночную симфонию. Северные сияния раскрывают свой волшебный
        шарм, играя светом и цветом в танце невесомости. В ее сердце бьется
        могучее сердце, где многовековые города возвышают свои кремлевские
        стены, будто стражи времени. Соборы, храмы, искусство – каждый камень в
        этих местах свидетель великой и славной истории. На улицах мегаполисов
        вибрирует энергия современности, и в этой ауре сливаются прошлое и
        настоящее.
        <br />
        <br />
        Россия – это страна, где восток встречается с западом, и сливаются
        воедино разные культуры, образуя мозаичную картину. В ее кулинарии –
        богатство вкусов, а в национальных традициях – таинство вечности.
        <br />
        <br />
        Эпохальные горные хребты, прекрасные озера, бурные реки и могучее море –
        все это прелестные элементы природы, которая отражает величие и
        многогранность России. В каждом метре земли звучит песня природы, словно
        приглашая к себе на душевную прогулку. Россия – это не только
        территория, огромная на карте, но и душа, богатая красотой и гордостью
        своего народа. В этой стране сливаются просторы и тайны, величие и уют,
        создавая уникальный характер, который остается в сердцах тех, кто ее
        открывает.
        <br />
        <br />
        <br />
        Для более глубокого изучения России студентами высших учебных заведений
        министерством образования был введен предмет "Основы Российской
        государственности".
      </Text>
    </S.Wrapper>
  );
};
