import { StyledCarousel, Text } from "../../styled";

import * as S from "./styled";

export const Territory = () => {
  return (
    <S.Wrapper id="ter">
      <b style={{ fontSize: "2em" }}>География России</b>
      <Text>
        Российская Федерация является самым крупным по площади государством на
        планете. Ее площадь в 2023 году вместе с Крымом, ДНР, ЛНР, Запорожской и
        Херсонской областями составила 17,2 млн. км².
        <br />
        <br />
        Россия находится одновременно в Европе и в Азии. Площадь европейской
        части России около 3,5 млн. км². Европейская часть России составляет
        около 35% территории всей Европы. В Азии находится почти 80% территории
        страны, только Сибирь имеет площадь 13,1 млн. км², что также превышает
        площадь любого азиатского государства. Таким образом, Россия является
        самой большой по площади страной, как Европы, так и Азии.
        <br />
        <br />
        По данным Росстата на 1 января 2023 года без учета новых российских
        регионов, по которым пока нет данных, РФ по населению находится на
        девятом месте в мире, – 146,4 млн. чел.
        <br />
        <br />
        Поскольку Россия занимает огромную площадь, она подразделяется на четыре
        различные климатические зоны: тропическую, субтропическую, умеренную,
        полярную. В зависимости от этого на разных территориях страны обитают
        различные флора и фауна.
        <br />
        <br />
        В пределах России выделяют несколько природных зон – зона арктических
        пустынь, тундры, лесотундры, тайги, смешанных и широколиственных лесов,
        лесостепи, степи, полупустынь, пустынь. Знание климатических и природных
        зон помогает улучшить жизнь в различных районах страны, оптимизировать и
        освоить для проживания ту или иную территорию.
        <br />
        <br />
        Россия – богатейшая страна в мире по запасам природных ресурсов. Она
        занимает первое место в мире:
        <br />
        <br />
        - по запасам нефти, природного газа, железной руды;
        <br />
        <br />
        - по лесному массиву (22% всех лесов земли; 1/4 мировой древесины
        производится в РФ);
        <br />
        <br />
        Второе место в мире:
        <br />
        <br />
        - по запасам питьевой воды (4 500 кубических километров; только в одном
        Байкале сосредоточено около 19 % мирового объема пресной озерной воды);
        <br />
        <br />
        - по месторождениям угля и редкоземельным металлам;
        <br />
        <br />
        Третье место в мире по добыче золота. Отметим мощные запасы российской
        поваренной соли, алмазов, изумрудов. В недрах российской земли сокрыта
        вся таблица Д.И. Менделеева.
        <br />
        <br />
        В России выращивается уникальное сапфировое стекло, которое используется
        по всему миру. Сапфир, обладающий отличными оптическими свойствами, к
        тому же этот второй по твердости материал после алмаза, используется в
        производстве светодиодов, применяемых в подсветке LED-телевизоров,
        часовой промышленности, мобильной электронике. Ставропольский завод
        химической промышленности «Монокристалл» на основе собственной
        уникальной технологии выращивает монокристаллы сапфира (искусственного
        корунда) весом более 100 кг. В июле 2015 года этот завод вырастил сапфир
        весом 300 кг – самый крупный кристалл в мире.
        <br />
        <br />
        На долю России приходится до 45 % мирового централизованного
        производства тепловой энергии. Система теплоснабжения, состоящая из 50
        тыс. локальных систем, обслуживает 17 тыс. предприятий. Тепловая энергия
        вырабатывается на 526 ТЭЦ (ТЭЦ общего пользования и ТЭЦ промышленных
        предприятий) и 72 144 котельных.
        <br />
        <br />
        Общая стоимость ресурсов страны по разным оценкам составляет от 45 до 75
        триллионов долларов.
        <br />
        <br />
        Россия, будучи мощной военной державой, превзошла другие страны по
        оснащенности и количеству военной техники. В настоящее время не только
        модернизируется ядерный арсенал, но и внедряются новые стратегические
        разработки. На боевом дежурстве стоят российские новинки стратегического
        ядерного вооружения – ракетные комплексы «Сармат», боевые блоки
        «Авангард». Ракетные комплексы «Тополь-М» и «Ярс» считаются самым
        эффективным оружием по сравнению с зарубежным вооружением. Мобильный
        ракетный комплекс «Ярс» не пеленгуется до момента запуска. Но и на
        финальном участке полета боевой блок начинает маневрировать так, что
        любая система ПВО становится бессмысленной.
        <br />
        <br />
        В развитии космоса и по количеству космических запусков Россия также
        занимает первые позиции. С полетом первого человека в космос Ю.
        Гагарина, первой женщины космонавта В. Терешковой, до выхода первого
        человека в открытый космос и самых протяженных космических полетов – ей
        пока нет равных. Более того, России принадлежит единственный в мире
        плавучий космодром.
        <br />
        <br />
        Россия исторически всегда славилась производством зерна. При этом более
        130 государств со всех частей света (более двух третей всех стран мира)
        импортируют российское зерно. Благодаря лояльной ценовой политике зерно
        обходится этим странам значительно дешевле, чем, американское или
        канадское.
        <br />
        <br />
        Многие российские компании занимают ведущее место в мире в своих
        отраслях. Таким образом, российской экономике есть чем гордиться, причем
        не только в сфере добычи ресурсов или в производстве оружия. РФ
        поставляет в другие страны ракетные двигатели, турбины,
        кузнечно-прессовое оборудование, тяжелые машины, оптику, химическую
        продукцию, атомные технологии. При этом Россия имеет самый низкий в мире
        государственный долг по отношению к ВВП – экономическому показателю,
        отражающему, сколько товаров и услуг производят в стране на одного
        человека.
      </Text>

      <StyledCarousel showThumbs={false} infiniteLoop swipeable>
        <img src="./ter-1.png" />
        <img src="./ter-2.png" />
        <img src="./ter-3.png" />
        <img src="./ter-4.png" />
      </StyledCarousel>
    </S.Wrapper>
  );
};
