import { Text } from "../../styled";
import * as S from "./styled";

export const End = () => {
  return (
    <S.Wrapper>
      <S.Title>Вывод</S.Title>
      <Text>
        Россия, с своим огромным пространством, разнообразным культурным
        наследием и важным геополитическим влиянием, представляет собой
        уникальный феномен в мировой истории. Познание истории этой страны не
        только позволяет оценить её вклад в различные области искусства, науки и
        литературы, но и является ключом к пониманию её современной роли на
        мировой арене. Россиянам и всем, кто интересуется глобальными событиями,
        важно осознавать исторические факторы, лежащие в основе современных
        вызовов и возможностей, чтобы строить более глубокие и информированные
        представления о мире и своей роли в нём.
      </Text>
    </S.Wrapper>
  );
};
